[
    {
        "title": "Visualizing Bike Traffic in Boston Area",
        "year": "2025",
        "image": "../images/biketraffic_project.png",
        "description": "I built an immersive, interactive map visualization of bike traffic in the Boston area during different times of day. I used D3, a Mapbox map, and a large dataset of real-world data to create a webpage that contains panning, zooming, and filtering to show bike lanes, bike stations, bike traffic, and traffic flow.",
        "url": "https://lseseri.github.io/biketraffic/"
    },
    {
        "title": "The Impact of Age, Weight, and Height on Anesthesia Depth During Surgery",
        "year": "2025",
        "image": "../images/anesthesia_project.png",
        "description": "I worked in a group to implement an interactive visualization using Korean surgery data to be able to adjust the age, height, and weight of a person and see the corresponding amount of anesthesia given throughout the duration of a surgery. We extracted the data from an API and were able to perform exploratory data analysis to upload the data needed for creating the visualization using D3.",
        "url": "https://masteryoda29.github.io/dsc106_project3/"
    },
    {
        "title": "Seasonal Trends Impact on Rain and Sunshine",
        "year": "2025",
        "image": "../images/seasonaltrends_project.png",
        "description": "I examined a set of monthly climate measurements for six major U.S. cities, and I created an expository visualization in order to determine sunshine and rainfall in different places are affected by temporal changes. The visualization allows for the comparison between east and west coast cities and how the amount of sunshine relates to the amount of rainfall these places receive.",
        "url": ""
    },
    {
        "title": "How Ovulation of Female Mice Affects Body Temperature",
        "year": "2025",
        "image": "../images/deceptive_project.png",
        "description": "I created a deceptive visualization to highlight how visualization designs can aim to intentionally mislead the viewer. Specifically, I focused on a dataset that contains information about female and male mice body temperatures and activity over the course of two weeks. The visualization allows the viewer to come to the incorrect inference that when female mice are ovulating, their body temperature is higher.",
        "url": ""
    },
    {
        "title": "Exploring the Seasonal Trends in Recipe Ratings",
        "year": "2024",
        "image": "../images/RecipeRating_project.png",
        "description": "I analyzed and cleaned the two datasets about recipes and ratings. I assessed the missingness of the data and performed a hypothesis test to determine if ratings differ between warmer and cooler seasons. I also created a model to be able to predict the rating of a recipe.",
        "url": "https://lseseri.github.io/RecipeRatings/"
    },
    {
        "title": "Stepwise Health: Examining Relationship Between Walkability and Physical Health in Counties and States",
        "year": "2024",
        "image": "../images/walkability_project.png",
        "description": "I investigated the relationship between walkability and health problems at both a county and state level in the U.S. I analyzed two datasets including a walkability index and physical health data. By merging and analyzing data, I seeked to determine if places that have higher walkability scores would have less health problems.",
        "url": "https://github.com/COGS108/Group008_WI24/blob/master/FinalProject_Group008_WI24.ipynb"
    },
    {
        "title": "Iste pariatur nobis necessitatibus!",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Quos dolore aspernatur odit tempora perspiciatis fuga quas, nesciunt necessitatibus laudantium. Obcaecati doloribus impedit beatae natus tempora rerum maiores, voluptas esse itaque ut fugit maxime id quaerat voluptates consequuntur illum?",
        "url": ""
    },
    {
        "title": "Aut nulla adipisci veniam?",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Odit illum dolores laudantium eos porro soluta architecto corrupti suscipit totam aperiam iste est, hic sequi dignissimos dolor saepe facilis molestiae sapiente doloremque itaque nam corporis reiciendis velit blanditiis? Illo.",
        "url": ""
    },
    {
        "title": "Totam sit dolor nesciunt!",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Nisi, labore! Veritatis, tempora? Optio velit asperiores, debitis minus ab est? Doloremque quibusdam nulla illum asperiores praesentium, maxime repudiandae laboriosam error? Consectetur ipsum hic fuga nesciunt itaque corrupti fugiat quibusdam?",
        "url": ""
    },
    {
        "title": "Ipsam quia earum fugit?",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Assumenda rem alias soluta. Esse repellendus neque rem vitae assumenda. Culpa, nulla eaque architecto nisi animi molestias corrupti fugit eos odio exercitationem soluta. Debitis, accusamus laborum accusantium ut magni tenetur?",
        "url": ""
    },
    {
        "title": "Velit fugiat magnam laboriosam?",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Dolor excepturi aspernatur error aperiam officiis totam rem qui esse tempore, dolores alias sint facere deleniti nam quae iste, velit ullam? Quisquam quam quod ratione quas corrupti facilis magni vero?",
        "url": ""
    },
    {
        "title": "Maxime molestiae sed explicabo!",
        "year": "2020",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Deserunt iusto libero molestias officia ipsam sequi, incidunt reprehenderit nisi unde odit nesciunt repudiandae. Deleniti sed nisi veritatis expedita veniam consequuntur nam facilis corporis culpa sit. Amet modi obcaecati itaque.",
        "url": ""
    }
]
